Ракович_В_Ю_70189466/src/AccumulationRegisters/АгрегатПосещаемости/АгрегатПосещаемости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АгрегатПосещаемости</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееВремяПриема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.КабинетыМедПункта</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПричинаПосещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПосещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ракович_В_Ю_70189466/src/AccumulationRegisters/АгрегатПосещаемости/ManagerModule.bsl
// Получить статистику посещений за период
Функция ПолучитьСтатистикуПосещений(ДатаНачала, ДатаОкончания, Группа = Неопределено) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    АгрегатПосещаемости.Студент.Группа КАК Группа,
    |    АгрегатПосещаемости.ПричинаПосещения,
    |    СУММА(АгрегатПосещаемости.КоличествоПосещений) КАК ВсегоПосещений,
    |    СРЕДНЕЕ(АгрегатПосещаемости.СреднееВремяПриема) КАК СреднееВремя
    |ИЗ
    |    РегистрНакопления.АгрегатПосещаемости КАК АгрегатПосещаемости
    |ГДЕ
    |    АгрегатПосещаемости.ПериодПосещения МЕЖДУ &ДатаНачала И &ДатаОкончания
    |    И (&Группа = ЗНАЧЕНИЕ(Справочник.Группы.ПустаяСсылка)
    |        ИЛИ АгрегатПосещаемости.Студент.Группа = &Группа)
    |
    |СГРУППИРОВАТЬ ПО
    |    АгрегатПосещаемости.Студент.Группа,
    |    АгрегатПосещаемости.ПричинаПосещения
    |
    |УПОРЯДОЧИТЬ ПО
    |    АгрегатПосещаемости.Студент.Группа,
    |    ВсегоПосещений УБЫВ";
    
    Если ЗначениеЗаполнено(Группа) Тогда
        Запрос.УстановитьПараметр("Группа", Группа);
    Иначе
        Запрос.УстановитьПараметр("Группа", Справочники.Группы.ПустаяСсылка);
    КонецЕсли;
    
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Найти студентов с частыми посещениями
Функция НайтиЧастоБолеющих(ПорогПосещений, ДатаНачала, ДатаОкончания) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    АгрегатПосещаемости.Студент,
    |    СУММА(АгрегатПосещаемости.КоличествоПосещений) КАК ВсегоПосещений
    |ИЗ
    |    РегистрНакопления.АгрегатПосещаемости КАК АгрегатПосещаемости
    |ГДЕ
    |    АгрегатПосещаемости.ПериодПосещения МЕЖДУ &ДатаНачала И &ДатаОкончания
    |    И АгрегатПосещаемости.ПричинаПосещения = &ПричинаЗаболевание
    |
    |СГРУППИРОВАТЬ ПО
    |    АгрегатПосещаемости.Студент
    |
    |ИМЕЮЩИЕ
    |    СУММА(АгрегатПосещаемости.КоличествоПосещений) >= &Порог
    |
    |УПОРЯДОЧИТЬ ПО
    |    ВсегоПосещений УБЫВ";
    
    Запрос.УстановитьПараметр("Порог", ПорогПосещений);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    Запрос.УстановитьПараметр("ПричинаЗаболевание", "Жалоба");
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции
